Revit 2027 API
PrintParameters.ColorDepth Property
 The color depth type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ColorDepthType ColorDepth { get; set; }
Public Property ColorDepth As ColorDepthType
	Get
	Set
public:
property ColorDepthType ColorDepth {
	ColorDepthType get ();
	void set (ColorDepthType value);
}
member ColorDepth : ColorDepthType with get, set
Property Value
ColorDepthType
See Also
Reference
PrintParameters Class
Autodesk.Revit.DB Namespace